Revit 2027 API
ParameterTypeId.MechanicalEquipmentSetIdParam Property
 "Mechanical Equipment Set"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MechanicalEquipmentSetIdParam { get; }
Public Shared ReadOnly Property MechanicalEquipmentSetIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MechanicalEquipmentSetIdParam {
	ForgeTypeId^ get ();
}
static member MechanicalEquipmentSetIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace